1. 数据来源
  * 世界银行公开数据


2. 最终目标
  * 将数据整理、输出为特定的格式，用于js动态可视化

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.set_option('display.max_columns',10)

# 1 数据预处理

1. 读取
2. 缺失值处理
3. 行列取舍
4. 字符串处理

## 1.1 读取

In [3]:
older_people=pd.read_csv('laolinghua.csv',na_values='..')# 指定缺失值

In [4]:
older_people.tail(3)

,Series Name,Series Code,Country Name,Country Code,1960 [YR1960],...,2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017],2018 [YR2018]
219,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN
220,Data from Database: 世界发展指标,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN
221,Last Updated: 01/30/2019,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN

## 1.2 缺失值处理

In [5]:
older_people.shape

(222, 63)

In [6]:
older_people.isnull().sum().values # 发现2018年的数据皆为空

array([  3,   5,   5,   5,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  28,  28,  28,  28,  28,
        28,  28,  28,  28,  28,  28,  28,  28,  28,  28,  28,  28,  28,
        28,  28,  28,  28,  29,  29,  29,  29,  29,  29, 222], dtype=int64)

In [7]:
older_people.drop(['Series Name','Series Code','2018 [YR2018]'],axis=1,inplace=True)

In [8]:
older_people.dropna(thresh=57,inplace=True) # 舍弃：每行中缺失值超过57个的

## 1.3 数据整合

In [9]:
older=older_people.set_index(['Country Name','Country Code']).stack().reset_index()# 构建多重index

In [10]:
older=older.rename(columns={'Country Name':'name','Country Code':'type','level_2':'dates',0:'value'})[['name','type','value','dates']]# 重命名

In [11]:
older['date']=older.dates.str.split(' ',expand=True)[0] # 只取列中年份

In [12]:
older.dtypes

name      object
type      object
value    float64
dates     object
date      object
dtype: object

In [13]:
older['value']=older['value'].astype(float).apply(lambda x:'%.2f'%x) # 转换为百分数

In [14]:
older[['name','type','value','date']].to_csv('65岁和65岁以上的人口（占总人口的百分比）.csv',index=False)# 输出为最终格式

In [15]:
older.head()

  name type value          dates  date
0  阿富汗  AFG  2.80  1960 [YR1960]  1960
1  阿富汗  AFG  2.81  1961 [YR1961]  1961
2  阿富汗  AFG  2.80  1962 [YR1962]  1962
3  阿富汗  AFG  2.78  1963 [YR1963]  1963
4  阿富汗  AFG  2.75  1964 [YR1964]  1964